import streamlit as at

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีแดง)
at.markdown("# :red[🏋️ คำนวณค่าดัชนีมวลกาย BMI]")
at.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเซ็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องรับค่าน้ำหนัก และ ส่วนสูง
weight = at.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม):",min_value=1.0, value=1.0)
height_cm = at.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):",min_value=1.0, value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if at.button("คำนวณค่า BMI 🎯 "):
  #แปลงส่วนสูงจาก cm เป็น เมตร แล้วคำนวณ BMI
  height_m = height_cm / 100
  bmi = weight / (height_m ** 2)

  at.write("--")
  at.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 4 แปลงผลค่า BMI ตามเกณฑ์
  if bmi < 18.5:
      at.warning("⚠️ คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
  elif 18.5 <= bmi < 23.0:
    at.success("🎉 คุณมีน้ำหนักอยู่ในเกณฑ์ (สุภาพดี)")
  elif 23.0 <= bmi < 25.0: 
   at.info("💡 คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
  else:
   at.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุภาพและออกกำลังกาย")

at.divider()
at.write("นางสาวธัญสุดา แก้ววิเชียร เลขที่ 40 ม.4/10")
